//
// Created by laqieer on 2020/2/8.
//

#ifndef FE7_JP_STUNNING_TRIBBLE_CHARACTER_H
#define FE7_JP_STUNNING_TRIBBLE_CHARACTER_H

#include <gba_types.h>

struct SupportData
{
    // æ”¯æ´å¯¹è±¡
    u8 targetCharacterId[7];
    // å¥½æ„Ÿåº¦åˆå§‹å€¼
    u8 favorInitial[7];
    // å¥½æ„Ÿåº¦æ¯å›åˆå¢åŠ å€¼
    u8 favorGrowth[7];
    // æ”¯æ´å¯¹è±¡äººæ•°
    u8 supportNumber;
};

struct Character {
    // äººç‰©åå­?
    u16 nameTextId;

    // äººç‰©æè¿°
    u16 descriptionTextId;

    // äººç‰©åºå·
    u8 id;

    // èŒä¸?(ç”¨äºåœ¨æ”¯æ´ç•Œé¢æ˜¾ç¤º)
    u8 job;

    // äººç‰©å¤´åƒ?
    u16 portrait;

    // å°å¤´åƒ?(è¦?ç›–äººç‰©å¤´åƒé‡Œçš?å°å¤´åƒ?,0-é»˜è®¤)
    // 0x00 Default
    // 0x01 Dragon
    // 0x02 Ostia/Caelin/Civilian
    // 0x03 Black Fang/Morph/Bandit
    u8 miniPortrait;

    // å±æ€§
    u8 affinity;

    // éƒ¨é˜Ÿèœå•æ’åºé¡ºåº?
    u8 sortID;

    // èƒ½åŠ›åŸºç¡€å€¼

    // ç­‰çº§
    s8 Lv;

    // hp
    s8 baseHp;
    // åŠ?/é­”åŠ›
    s8 baseStr;
    // æŠ€æœ¯
    s8 baseSkl;
    // é€Ÿåº¦
    s8 baseSpd;
    // å®ˆå¤?
    s8 baseDef;
    // é­”é˜²
    s8 baseRes;
    // å¹¸è¿?
    s8 baseLuk;
    // ä½“æ?¼é™?åŠ?å€¼
    s8 baseConBonus;

    // æ­¦å™¨ç†Ÿç»?åº¦

    // å‰‘ç­‰çº§
    u8 levelSword;
    // æªç­‰çº§
    u8 levelLance;
    // æ–§ç­‰çº§
    u8 levelAxe;
    // å¼“ç­‰çº§
    u8 levelBow;
    // æ–ç­‰çº§
    u8 levelStaff;
    // ç?ç­‰çº§
    u8 levelAnima;
    // å…‰ç­‰çº§
    u8 levelLight;
    // é—?ç­‰çº§
    u8 levelDark;

    // æˆé•¿ç?

    // hpæˆé•¿
    u8 growthHp;
    // åŠ?/é­”åŠ›æˆé•¿
    u8 growthStr;
    // æŠ€æœ¯æˆé•¿
    u8 growthSkl;
    // é€Ÿåº¦æˆé•¿
    u8 growthSpd;
    // å®ˆå¤?æˆé•¿
    u8 growthDef;
    // é­”é˜²æˆé•¿
    u8 growthRes;
    // å¹¸è¿æ?é•¿
    u8 growthLuk;

    // äººç‰©æˆ˜æ–—åŠ¨ç”»ç‰¹æ®Šè°?è‰²æ¿ç¼–å·

    // ä½ä½èŒä¸?
    u8 paletteIdUnpromoted;
    // é«˜ä½èŒä¸?
    u8 paletteIdPromoted;

    // äººç‰©ç‰¹æ®Šæ?˜æ–—åŠ¨ç”»ç¼–å·

    // ä½ä½èŒä¸?
    u8 battleAnimationIdUnpromoted;
    // é«˜ä½èŒä¸?
    u8 battleAnimationIdPromoted;

    // å¡«å…?å­—èŠ‚
    u8 pad_27;

    // ç‰¹æ®Šè?½åŠ?(äººç‰©/èŒä¸šå?±é€?)

    // Class & Character Ability 1

    // éª‘ä¹˜ç³»æ•‘å?º
    u8 ability_mountedAid:1;
    // å†ç§»åŠ¨
    u8 ability_moveAgain:1;
    // ç›—çª?
    u8 ability_steal:1;
    // ä½¿ç”¨ç›—è´¼é’¥åŒ?
    u8 ability_theifKey:1;
    // èˆè¹?
    u8 ability_dance:1;
    // å¹å¥?
    u8 ability_play:1;
    // å¿?æ€åŠ?æˆ?
    u8 ability_criticalBonus:1;
    // ä½¿ç”¨å¼©è½¦
    u8 ability_ballista:1;

    // Class & Character Ability 2

    // ä¸Šä½èŒä¸?
    u8 ability_promoted:1;
    // è¿è¾“é˜Ÿ
    u8 ability_supplyDepot:1;
    // éª‘é©¬å›¾æ ?æ˜¾ç¤º
    u8 ability_mountedIcon:1;
    // é¾™éª‘å£«å›¾æ ?æ˜¾ç¤º
    u8 ability_dragonKnightIcon:1;
    // å¤©é©¬éª‘å£«å›¾æ ?æ˜¾ç¤º
    u8 ability_pegasusKnightIcon:1;
    // é¢?ä¸»
    u8 ability_lord:1;
    // å¥³æ€§
    u8 ability_female:1;
    // bosså›¾æ ?æ˜¾ç¤º
    u8 ability_boss:1;

    // Class & Character Ability 3

    // ç½—ä¼Šæ­¦å™¨é”? -> æš—å™¨æ­¦å™¨é”?
    u8 ability_RoyWeaponLock:1;
    // å€­åˆ€æ­¦å™¨é”?
    u8 ability_WoDaoWeaponLock:1;
    // é¾™çŸ³æ­¦å™¨é”?
    u8 ability_dragonStoneWeaponLock:1;
    // äººé€?äºº(åŒ?æ‹¬ä½œä¸ºbosså‡ºç°æ—¶çš?ç»´è¾¾)
    u8 ability_morph:1;
    // æ—?æ³•é€‰ä¸­(ä¾‹å¦‚å€’ä¸‹çš„å°¼å°”æ–¯)
    u8 ability_preventControl:1;
    // å¤©é©¬ä¸‰è§’æ”»å‡»
    u8 ability_pegasusTriangleAttack:1;
    // é‡ç”²ä¸‰è§’æ”»å‡»
    u8 ability_armorTriangleAttack:1;
    // ä¸è¦ä½¿ç”¨è¿™ä¸ªèƒ½åŠ›ä½?
    u8 ability_forbidden:1;

    // Class & Character Ability 4

    // å‡»ç ´æ—?ç»éªŒå€¼?¼Œç¬æ€æ—?æ•?(ä¾‹å¦‚å°?é­”è€?).
    u8 ability_noExp:1;
    // ç¬æ€
    u8 ability_lethality:1;
    // å°?é­?
    u8 ability_magicSeal:1;
    // ç‰©å“æ?æœ€åä¸€ä¸ªç‰©å“å¯æ‰è½
    u8 ability_dropLastItem:1;
    // è‰¾åˆ©ä¹Œå¾·æ­¦å™¨é”?
    u8 ability_EliwoodWeaponLock:1;
    // æµ·å…‹æ‰˜å°”æ­¦å™¨é”?
    u8 ability_HectorWeaponLock:1;
    // ç³æ­¦å™¨é”?
    u8 ability_LynWeaponLock:1;
    // é˜¿ç‰¹æ–¯æ­¦å™¨é”? -> å¬å”¤å¸ˆæ­¦å™¨é”?
    u8 ability_AthosWeaponLock:1;

    // æ”¯æ´è®¾å®?
    struct SupportData *support;

    // æ§åˆ¶ä¸åŒäººç‰©åœ¨æŸä¸ªåœºæ™¯ä¸‹è¯´ä¸åŒçš?è¯?
    // http://feuniverse.us/t/fe7-ch25h-fort-seizing-dialogue/1446
    u8 dialogueId;
};

extern const struct Character characters[];

enum Affinity {None = 0, Fire, Thunder, Wind, Water, Dark, Light, Anima};

struct ItemSlot
{
    u8 itemId;
    u8 residualDurability;
};

struct SMSHandle
{
    /* 00 */ struct SMSHandle* pNext;

    /* 04 */ short xDisplay;
    /* 06 */ short yDisplay;

    /* 08 */ u16 oam2Base;

    /* 0A */ u8 _u0A;
    /* 0B */ s8 config;
};

// Unit data in RAM
struct Unit
{
    struct Character *character;
    struct Job *job;
    u8 lv;
    u8 exp;
    u8 unk_A;
    u8 number:6;
    u8 side:2;
    u32 state;
    u8 positionX;
    u8 positionY;
    s8 maxHp;
    s8 hp;
    s8 pow;
    s8 skl;
    s8 spd;
    s8 def;
    s8 res;
    s8 luk;
    s8 conBonus;
    u8 aidUnitNumber;
    u8 ballistaIndex;
    s8 movBonus;

    struct ItemSlot items[5];

    u8 levelSword;
    u8 levelLance;
    u8 levelAxe;
    u8 levelBow;
    u8 levelStaff;
    u8 levelAnima;
    u8 levelLight;
    u8 levelDark;

    u8 stateType:4;
    u8 stateTurn:4;

    u8 sightBonus:4;
    u8 resBonus:4;

    u8 levelSupport[7];

    u8 unlockSupport1:1;
    u8 unlockSupport2:1;
    u8 unlockSupport3:1;
    u8 unlockSupport4:1;
    u8 unlockSupport5:1;
    u8 unlockSupport6:1;
    u8 unlockSupport7:1;
    u8 unlockSupport8:1;

    u8 unk_3A;
    u8 unk_3B;

    struct SMSHandle* pMapSpriteHandle;

    u8 AI_healing:3;
    u8 AI_targeting:5;
    u8 AI_retreat;
    u8 AI_action;
    u8 AI_action_counter;
    u8 AI_movement;
    u8 AI_movement_counter;

    u8 unk_46;
    u8 unk_47;
};

enum
{
    // Unit state constant masks

    UNIT_STATE_NONE = 0,

    UNIT_STATE_HIDDEN = (1 << 0),
    UNIT_STATE_UNSELECTABLE = (1 << 1),
    UNIT_STATE_DEAD = (1 << 2),
    UNIT_STATE_NOT_DEPLOYED = (1 << 3),
    UNIT_STATE_RESCUING = (1 << 4),
    UNIT_STATE_RESCUED = (1 << 5),
    UNIT_STATE_HAS_MOVED = (1 << 6), // Bad name?
    UNIT_STATE_CANTOING = UNIT_STATE_HAS_MOVED, // Alias
    UNIT_STATE_UNDER_A_ROOF = (1 << 7),
    UNIT_STATE_BIT8 = (1 << 8), // has been seen?
    UNIT_STATE_BIT9 = (1 << 9), // hidden by fog?
    UNIT_STATE_HAS_MOVED_AI = (1 << 10),
    UNIT_STATE_CANTOING_AI = UNIT_STATE_HAS_MOVED_AI,
    UNIT_STATE_IN_BALLISTA = (1 << 11),
    UNIT_STATE_DROP_ITEM = (1 << 12),
    UNIT_STATE_GROWTH_BOOST = (1 << 13),
    UNIT_STATE_SOLOANIM_1 = (1 << 14),
    UNIT_STATE_SOLOANIM_2 = (1 << 15),
    UNIT_STATE_BIT16 = (1 << 16),
    UNIT_STATE_BIT17 = (1 << 17),
    UNIT_STATE_BIT18 = (1 << 18),
    UNIT_STATE_BIT19 = (1 << 19),
    UNIT_STATE_BIT20 = (1 << 20),
    UNIT_STATE_BIT21 = (1 << 21),
    UNIT_STATE_BIT22 = (1 << 22),
    UNIT_STATE_BIT23 = (1 << 23),
    // = (1 << 24),
    UNIT_STATE_BIT25 = (1 << 25),
    UNIT_STATE_BIT26 = (1 << 26),
    // = (1 << 27),
    // = (1 << 28),
    // = (1 << 29),
    // = (1 << 30),
    // = (1 << 31),

    // Helpers
    UNIT_STATE_UNAVAILABLE = (UNIT_STATE_DEAD | UNIT_STATE_NOT_DEPLOYED | UNIT_STATE_BIT16),
};

enum
{
    // Unit status identifiers

    UNIT_STATUS_NONE = 0,

    UNIT_STATUS_POISON = 1,
    UNIT_STATUS_SLEEP = 2,
    UNIT_STATUS_SILENCED = 3,
    UNIT_STATUS_BERSERK = 4,

    UNIT_STATUS_ATTACK = 5,
    UNIT_STATUS_DEFENSE = 6,
    UNIT_STATUS_CRIT = 7,
    UNIT_STATUS_AVOID = 8,

    UNIT_STATUS_SICK = 9,
    UNIT_STATUS_RECOVER = 10,

    UNIT_STATUS_PETRIFY = 11,
    UNIT_STATUS_12 = 12,
    UNIT_STATUS_13 = 13,
};

#define PLAYER_TOTAL_AMOUNT 62
#define ENEMY_TOTAL_AMOUNT 50
#define NPC_TOTAL_AMOUNT 20
#define P4_TOTAL_AMOUNT 5

extern struct Unit playerUnits[PLAYER_TOTAL_AMOUNT];
extern struct Unit enemyUnits[ENEMY_TOTAL_AMOUNT];
extern struct Unit NPCUnits[NPC_TOTAL_AMOUNT];
extern struct Unit P4Units[P4_TOTAL_AMOUNT];

enum UnitSide {PlayerSide = 0, NPCSide, EnemySide, P4Side};

extern struct Unit *currentActiveUnit;

struct SupportBonuses
{
    /* 00 */ u8 affinity;

    /* 01 */ u8 bonusAttack;
    /* 02 */ u8 bonusDefense;
    /* 03 */ u8 bonusHit;
    /* 04 */ u8 bonusAvoid;
    /* 05 */ u8 bonusCrit;
    /* 06 */ u8 bonusDodge;
};

int getUnitSupportBonuses(struct Unit* unit, struct SupportBonuses* bonuses);

// support conversation between character 1 & character 2
struct SupportConversation
{
    u8 character1;
    u8 character2;
    int rankA;
    int rankB;
    int rankC;
    int unk;
};

extern struct Unit *unitAtLeft;
extern struct Unit *unitAtRight;

#endif //FE7_JP_STUNNING_TRIBBLE_CHARACTER_H
